skydivervrn/flysight-2-firmware/STM32_WPAN/App/app_ble.c
          /* Process both ADV_IND and SCAN_RSP so service UUID in scan response is caught */
          if (event_type == ADV_IND || event_type == SCAN_RSP)
          {
            while(k < event_data_size)
            {
              adlength = adv_report_data[k];
              if (adlength == 0) break; /* malformed — stop */
              adtype = adv_report_data[k + 1];

              if (adtype == AD_TYPE_128_BIT_SERV_UUID ||
                  adtype == AD_TYPE_128_BIT_SERV_UUID_CMPLT_LIST)
              {
                /* Each UUID is 16 bytes; there may be multiple */
                uint8_t uuid_data_len = adlength - 1;
                const uint8_t *uuid_data = &adv_report_data[k + 2];
                uint8_t ui;
                for (ui = 0; ui + 16 <= uuid_data_len; ui += 16)
                {
                  if (memcmp(&uuid_data[ui], activelook_svc_uuid, 16) == 0)
                  {
                    APP_DBG_MSG("-- Found ActiveLook service UUID in adv data\n\r");
                    foundUUID = 1;
                    break;
                  }
                }
              }
              else if (adtype == AD_TYPE_COMPLETE_LOCAL_NAME ||
                       adtype == AD_TYPE_SHORTENED_LOCAL_NAME)
              {
                const uint8_t *name_data = &adv_report_data[k + 2];
                uint8_t name_len = adlength - 1;

                APP_DBG_MSG("-- Found Device Name: '");
                {
                  uint8_t ni;
                  for (ni = 0; ni < name_len; ni++) { APP_DBG_MSG("%c", name_data[ni]); }
                }
                APP_DBG_MSG("'\n\r");

                /* Capture the trailing 6 chars of the name = ENGO Customer Serial
                 * (e.g. "ENGO 3 123456" -> "123456"). Per the ActiveLook API the
                 * serial is the last 6 chars of the COMPLETE 16-char name; a
                 * SHORTENED name is truncated at the tail, so its last 6 chars are
                 * NOT the serial — never capture from it (a wrong capture would be
                 * permanently auto-bound to engo3.txt). */
                if (adtype == AD_TYPE_COMPLETE_LOCAL_NAME &&
                    name_len >= FS_ENGO_SERIAL_LEN)
                {
                  uint8_t si;
                  for (si = 0; si < FS_ENGO_SERIAL_LEN; si++)
                    candSerial[si] = (char)name_data[name_len - FS_ENGO_SERIAL_LEN + si];
                  candSerial[FS_ENGO_SERIAL_LEN] = '\0';
                  haveSerial = 1;
                }

                /* Case-insensitive match of known ActiveLook/ENGO advertised-name
                 * prefixes. ENGO 2/3 advertise "ENGO ..."; other ActiveLook devices
                 * use "AL-"/"AL "/"ActiveLook"/"A.Look". The name may live only in the
                 * scan response, which is why we run an active scan and parse both. */
                {
                  static const char *al_prefixes[] = { "ENGO", "AL-", "AL ", "ACTIVELOOK", "A.LOOK" };
                  uint8_t pi;
                  for (pi = 0; pi < 5 && !foundName; pi++)
                  {
                    const char *pfx = al_prefixes[pi];
                    uint8_t plen = (uint8_t)strlen(pfx);
                    if (name_len >= plen)
                    {
                      uint8_t mi, ok = 1;
                      for (mi = 0; mi < plen; mi++)
                      {
                        uint8_t c = name_data[mi];
                        if (c >= 'a' && c <= 'z') c = (uint8_t)(c - 32); /* to upper */
                        if (c != (uint8_t)pfx[mi]) { ok = 0; break; }
                      }
                      if (ok) { foundName = 1; APP_DBG_MSG("-- Name prefix '%s' matched\n\r", pfx); }
                    }
                  }
                }
              }

              k += adlength + 1;
            } /* end while(k < event_data_size) */

            /* Decide whether to accept this device.
             *  - BOUND   (engo3.txt present): must be an ActiveLook device (UUID or
             *            name prefix) AND its serial (trailing 6 chars of the
             *            advertised name) must equal the saved one. The serial
             *            NARROWS the ActiveLook filter, it does not replace it —
             *            otherwise any BLE device whose name happens to end in
             *            those 6 chars would be connected to.
             *  - UNBOUND (no engo3.txt): first ActiveLook device wins (UUID or
             *            name prefix), and we remember its serial to persist once
             *            the link is up (auto-bind on first ever connect). */
            uint8_t accept = 0;
            if (BleApplicationContext.EndDevice1Found == 0x00)
            {
              if (FS_EngoBind_IsBound())
                accept = ((foundUUID || foundName) &&
                          haveSerial && FS_EngoBind_SerialMatches(candSerial));
              else
                accept = (foundUUID || foundName);
            }

            if (accept)
            {
              APP_DBG_MSG("-- Found matching ENGO/ActiveLook device!\n\r");
              BleApplicationContext.EndDevice1Found = 0x01;

              /* Unbound first connect: stash the serial to learn after link-up. */
              if (!FS_EngoBind_IsBound() && haveSerial)
                FS_EngoBind_NotePending(candSerial);

              /* Store BD Address and Address_Type from the advertising report */
              P2P_SERVER1_BDADDR[0] = le_advertising_event->Advertising_Report[0].Address[0];
              P2P_SERVER1_BDADDR[1] = le_advertising_event->Advertising_Report[0].Address[1];
              P2P_SERVER1_BDADDR[2] = le_advertising_event->Advertising_Report[0].Address[2];
              P2P_SERVER1_BDADDR[3] = le_advertising_event->Advertising_Report[0].Address[3];
              P2P_SERVER1_BDADDR[4] = le_advertising_event->Advertising_Report[0].Address[4];
              P2P_SERVER1_BDADDR[5] = le_advertising_event->Advertising_Report[0].Address[5];
              P2P_SERVER1_ADDR_TYPE  = le_advertising_event->Advertising_Report[0].Address_Type;

              APP_DBG_MSG("   Address (%s): %02X:%02X:%02X:%02X:%02X:%02X\n\r",
                          P2P_SERVER1_ADDR_TYPE == 0 ? "Public" : "Random",
                          P2P_SERVER1_BDADDR[5], P2P_SERVER1_BDADDR[4], P2P_SERVER1_BDADDR[3],
                          P2P_SERVER1_BDADDR[2], P2P_SERVER1_BDADDR[1], P2P_SERVER1_BDADDR[0]);
            }
          } /* end if (event_type == ADV_IND || event_type == SCAN_RSP) */
          break;

        default:
          /* USER CODE BEGIN SUBEVENT_DEFAULT */

          /* USER CODE END SUBEVENT_DEFAULT */
          break;
      }

      /* USER CODE BEGIN META_EVT */

      /* USER CODE END META_EVT */
      break; /* HCI_LE_META_EVT_CODE */
    }

    case HCI_VENDOR_SPECIFIC_DEBUG_EVT_CODE:
      p_blecore_evt = (evt_blecore_aci*) p_event_pckt->data;
      /* USER CODE BEGIN EVT_VENDOR */

      /* USER CODE END EVT_VENDOR */
      switch (p_blecore_evt->ecode)
      {
        /* USER CODE BEGIN ecode */

        /* USER CODE END ecode */

        /**
         * SPECIFIC to Custom Template APP
         */
        case ACI_L2CAP_CONNECTION_UPDATE_REQ_VSEVT_CODE:
          {
            /* USER CODE BEGIN EVT_BLUE_L2CAP_CONNECTION_UPDATE_REQ */

            /* USER CODE END EVT_BLUE_L2CAP_CONNECTION_UPDATE_REQ */
            pr = (aci_l2cap_connection_update_req_event_rp0 *) p_blecore_evt->data;
            result = aci_l2cap_connection_parameter_update_resp(pr->Connection_Handle,
                                                                pr->Interval_Min,
                                                                pr->Interval_Max,
                                                                pr->Latency,
                                                                pr->Timeout_Multiplier,
                                                                CONN_L1,
                                                                CONN_L2,
																pr->Identifier,
                                                                0x00);
            APP_DBG_MSG("\r\n\r** NO UPDATE \n\r");
            if(result != BLE_STATUS_SUCCESS)
            {
              /* USER CODE BEGIN BLE_STATUS_SUCCESS */

